
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |       3 |          2 |          0 |
## Affected resources by action

|  Action  | Resources                                                        |
|:--------:|:-----------------------------------------------------------------|
|    🟢     | `module.ih_8_repos["aws-control"].github_branch_default.main`    |
|    🟢     | `module.ih_8_repos["aws-control"].github_branch_protection.main` |
|    🟢     | `module.ih_8_repos["aws-control"].github_repository.repo`        |
|    🟢     | `module.ih_8_repos["aws-s3-control"].github_repository.repo:`    |
|    🟡     | `module.ih_8_repos["aws-s3-control"].github_repository.repo`     |
|    🟡     | `module.ih_8_repos["github-control"].github_repository.repo`     |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/d0a98e3b-5985-4812-9b4f-ed532ec3d3ef/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
module.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]
github_repository.terraform-template: Refreshing state... [id=terraform-template]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
github_team.dev: Refreshing state... [id=7332815]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team_members.dev: Refreshing state... [id=7332815]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
module.ih_8_repos["github-control"].github_actions_secret.role[0]: Refreshing state... [id=github-control:AWS_ROLE]
module.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]
module.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]
github_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ih_8_repos["aws-control"].github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + id         = (known after apply)
      + rename     = false
      + repository = "aws-control"
    }

  # module.ih_8_repos["aws-control"].github_branch_protection.main will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "Terraform Plan",
            ]
          + strict   = true
        }
    }

  # module.ih_8_repos["aws-control"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "InfraHouse Basic AWS configuration"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "aws-control"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "infrahouse8"
          + repository           = "terraform-template"
        }
    }

  # module.ih_8_repos["aws-s3-control"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "aws-s3-control"
        name                        = "aws-s3-control"
        # (31 unchanged attributes hidden)

      + template {
          + include_all_branches = false
          + owner                = "infrahouse8"
          + repository           = "terraform-template"
        }

        # (1 unchanged block hidden)
    }

  # module.ih_8_repos["github-control"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "github-control"
        name                        = "github-control"
        # (33 unchanged attributes hidden)

      + template {
          + include_all_branches = false
          + owner                = "infrahouse8"
          + repository           = "terraform-template"
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.ih_8_repos["aws-s3-control"].github_repository.repo: Refreshing state... [id=aws-s3-control]%0Agithub_repository.terraform-template: Refreshing state... [id=terraform-template]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["github-control"].github_actions_secret.role[0]: Refreshing state... [id=github-control:AWS_ROLE]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_default.main: Refreshing state... [id=aws-s3-control]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]%0Amodule.ih_8_repos["aws-s3-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOJCeiUc4CEZvQ]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]%0Agithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.ih_8_repos["aws-control"].github_branch_default.main will be created%0A  + resource "github_branch_default" "main" {%0A      + branch     = "main"%0A      + id         = (known after apply)%0A      + rename     = false%0A      + repository = "aws-control"%0A    }%0A%0A  # module.ih_8_repos["aws-control"].github_branch_protection.main will be created%0A  + resource "github_branch_protection" "main" {%0A      + allows_deletions                = false%0A      + allows_force_pushes             = false%0A      + blocks_creations                = false%0A      + enforce_admins                  = false%0A      + id                              = (known after apply)%0A      + lock_branch                     = false%0A      + pattern                         = "main"%0A      + repository_id                   = (known after apply)%0A      + require_conversation_resolution = false%0A      + require_signed_commits          = false%0A      + required_linear_history         = false%0A%0A      + required_pull_request_reviews {%0A          + require_last_push_approval      = false%0A          + required_approving_review_count = 0%0A        }%0A%0A      + required_status_checks {%0A          + contexts = [%0A              + "Terraform Plan",%0A            ]%0A          + strict   = true%0A        }%0A    }%0A%0A  # module.ih_8_repos["aws-control"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "InfraHouse Basic AWS configuration"%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_downloads               = false%0A      + has_issues                  = true%0A      + has_projects                = false%0A      + has_wiki                    = false%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "aws-control"%0A      + node_id                     = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + visibility                  = (known after apply)%0A      + vulnerability_alerts        = true%0A%0A      + security_and_analysis {%0A          + advanced_security {%0A              + status = (known after apply)%0A            }%0A%0A          + secret_scanning {%0A              + status = (known after apply)%0A            }%0A%0A          + secret_scanning_push_protection {%0A              + status = (known after apply)%0A            }%0A        }%0A%0A      + template {%0A          + include_all_branches = false%0A          + owner                = "infrahouse8"%0A          + repository           = "terraform-template"%0A        }%0A    }%0A%0A  # module.ih_8_repos["aws-s3-control"].github_repository.repo will be updated in-place%0A  ~ resource "github_repository" "repo" {%0A        id                          = "aws-s3-control"%0A        name                        = "aws-s3-control"%0A        # (31 unchanged attributes hidden)%0A%0A      + template {%0A          + include_all_branches = false%0A          + owner                = "infrahouse8"%0A          + repository           = "terraform-template"%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ih_8_repos["github-control"].github_repository.repo will be updated in-place%0A  ~ resource "github_repository" "repo" {%0A        id                          = "github-control"%0A        name                        = "github-control"%0A        # (33 unchanged attributes hidden)%0A%0A      + template {%0A          + include_all_branches = false%0A          + owner                = "infrahouse8"%0A          + repository           = "terraform-template"%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0APlan: 3 to add, 2 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvZDBhOThlM2ItNTk4NS00ODEyLTliNGYtZWQ1MzJlYzNkM2VmL3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtczMtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9yZXBvc2l0b3J5LnRlcnJhZm9ybS10ZW1wbGF0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9vcmdhbml6YXRpb25fc2V0dGluZ3MuaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTIxOTg0MjYzXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtX21lbWJlcnMuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX2RlZmF1bHQubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5yb2xlWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpBV1NfUk9MRV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uLm1haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUJQUl9rd0RPSkNlaVVjNENFWnZRXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVB8QVdTQ1VSUkVOVF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9hY3Rpb25zX3NlY3JldC5weXBpX2FwaV90b2tlbltcImluZnJhaG91c2UtdG9vbGtpdFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gIFx1MDAxYlszMm0rXHUwMDFiWzBtIGNyZWF0ZVxuICBcdTAwMWJbMzNtflx1MDAxYlswbSB1cGRhdGUgaW4tcGxhY2Vcblx1MDAxYlswbVxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbVxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9icmFuY2hfZGVmYXVsdFwiIFwibWFpblwiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWJyYW5jaFx1MDAxYlswbVx1MDAxYlswbSAgICAgPSBcIm1haW5cIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb3NpdG9yeVx1MDAxYlswbVx1MDAxYlswbSA9IFwiYXdzLWNvbnRyb2xcIlxuICAgIH1cblxuXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uLm1haW5cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX2JyYW5jaF9wcm90ZWN0aW9uXCIgXCJtYWluXCIge1xuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dzX2RlbGV0aW9uc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd3NfZm9yY2VfcHVzaGVzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWJsb2Nrc19jcmVhdGlvbnNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZW5mb3JjZV9hZG1pbnNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbG9ja19icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wYXR0ZXJuXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJtYWluXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9zaXRvcnlfaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXF1aXJlX2NvbnZlcnNhdGlvbl9yZXNvbHV0aW9uXHUwMDFiWzBtXHUwMDFiWzBtID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVfc2lnbmVkX2NvbW1pdHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVxdWlyZWRfbGluZWFyX2hpc3RvcnlcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICA9IGZhbHNlXG5cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXJlcXVpcmVkX3B1bGxfcmVxdWVzdF9yZXZpZXdzIHtcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXF1aXJlX2xhc3RfcHVzaF9hcHByb3ZhbFx1MDAxYlswbVx1MDAxYlswbSAgICAgID0gZmFsc2VcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXF1aXJlZF9hcHByb3ZpbmdfcmV2aWV3X2NvdW50XHUwMDFiWzBtXHUwMDFiWzBtID0gMFxuICAgICAgICB9XG5cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXJlcXVpcmVkX3N0YXR1c19jaGVja3Mge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWNvbnRleHRzXHUwMDFiWzBtXHUwMDFiWzBtID0gW1xuICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cIlRlcnJhZm9ybSBQbGFuXCIsXG4gICAgICAgICAgICBdXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RyaWN0XHUwMDFiWzBtXHUwMDFiWzBtICAgPSB0cnVlXG4gICAgICAgIH1cbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG9cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19hdXRvX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfbWVyZ2VfY29tbWl0XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfcmViYXNlX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfc3F1YXNoX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYXJjaGl2ZWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlZmF1bHRfYnJhbmNoXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlbGV0ZV9icmFuY2hfb25fbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZXNjcmlwdGlvblx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgPSBcIkluZnJhSG91c2UgQmFzaWMgQVdTIGNvbmZpZ3VyYXRpb25cIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZXRhZ1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZnVsbF9uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZ2l0X2Nsb25lX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaGFzX2Rvd25sb2Fkc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19pc3N1ZXNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19wcm9qZWN0c1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfd2lraVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHRtbF91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHR0cF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgID0gXCJQUl9USVRMRVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1tZXJnZV9jb21taXRfdGl0bGVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSBcIk1FUkdFX01FU1NBR0VcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhd3MtY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ub2RlX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wcml2YXRlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gPSBcIkNPTU1JVF9NRVNTQUdFU1wiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zc2hfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdm5fdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG12aXNpYmlsaXR5XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG12dWxuZXJhYmlsaXR5X2FsZXJ0c1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgPSB0cnVlXG5cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXNlY3VyaXR5X2FuZF9hbmFseXNpcyB7XG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtYWR2YW5jZWRfc2VjdXJpdHkge1xuICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmcge1xuICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmdfcHVzaF9wcm90ZWN0aW9uIHtcbiAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuICAgICAgICB9XG5cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXRlbXBsYXRlIHtcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pbmNsdWRlX2FsbF9icmFuY2hlc1x1MDAxYlswbVx1MDAxYlswbSA9IGZhbHNlXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtb3duZXJcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2U4XCJcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICA9IFwidGVycmFmb3JtLXRlbXBsYXRlXCJcbiAgICAgICAgfVxuICAgIH1cblxuXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiYXdzLXMzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwb1x1MDAxYlswbSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbSAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgICAgXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhd3MtczMtY29udHJvbFwiXG4gICAgICAgIFx1MDAxYlsxbVx1MDAxYlswbW5hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXdzLXMzLWNvbnRyb2xcIlxuICAgICAgICBcdTAwMWJbOTBtIyAoMzEgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG10ZW1wbGF0ZSB7XG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaW5jbHVkZV9hbGxfYnJhbmNoZXNcdTAwMWJbMG1cdTAwMWJbMG0gPSBmYWxzZVxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW93bmVyXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlOFwiXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb3NpdG9yeVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgPSBcInRlcnJhZm9ybS10ZW1wbGF0ZVwiXG4gICAgICAgIH1cblxuICAgICAgICBcdTAwMWJbOTBtIyAoMSB1bmNoYW5nZWQgYmxvY2sgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuICAgIH1cblxuXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwb1x1MDAxYlswbSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbSAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgICAgXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJnaXRodWItY29udHJvbFwiXG4gICAgICAgIFx1MDAxYlsxbVx1MDAxYlswbW5hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICA9IFwiZ2l0aHViLWNvbnRyb2xcIlxuICAgICAgICBcdTAwMWJbOTBtIyAoMzMgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG10ZW1wbGF0ZSB7XG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaW5jbHVkZV9hbGxfYnJhbmNoZXNcdTAwMWJbMG1cdTAwMWJbMG0gPSBmYWxzZVxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW93bmVyXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlOFwiXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb3NpdG9yeVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgPSBcInRlcnJhZm9ybS10ZW1wbGF0ZVwiXG4gICAgICAgIH1cblxuICAgICAgICBcdTAwMWJbOTBtIyAoMSB1bmNoYW5nZWQgYmxvY2sgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuICAgIH1cblxuXHUwMDFiWzBtXHUwMDFiWzFtUGxhbjpcdTAwMWJbMG0gMyB0byBhZGQsIDIgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuXG5cdTAwMWJbMG1cdTAwMWJbOTBtXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTAwMWJbMG1cblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1zMy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9yZXBvc2l0b3J5LnRlcnJhZm9ybS10ZW1wbGF0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9vcmdhbml6YXRpb25fc2V0dGluZ3MuaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTIxOTg0MjYzXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9tZW1iZXJzaGlwLmluZnJhaG91c2VbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlOmFrdXptaW5za3ldXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW1fbWVtYmVycy5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX2RlZmF1bHQubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQucm9sZVswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6QVdTX1JPTEVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtczMtY29udHJvbFwiXS5naXRodWJfYnJhbmNoX2RlZmF1bHQubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0pDZWlVYzRDRVp2UV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0kydnU3TTRDQWljaV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLlx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo5OTA0NjY3NDgwNDU6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tZGhJSTlQfEFXU0NVUlJFTlRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnB5cGlfYXBpX3Rva2VuW1wiaW5mcmFob3VzZS10b29sa2l0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6UFlQSV9BUElfVE9LRU5dXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS10b29sa2l0XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgIFx1MDAxYlszMm0rXHUwMDFiWzBtIGNyZWF0ZSUwQSAgXHUwMDFiWzMzbX5cdTAwMWJbMG0gdXBkYXRlIGluLXBsYWNlJTBBXHUwMDFiWzBtJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5paF84X3JlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2JyYW5jaF9kZWZhdWx0Lm1haW5cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9icmFuY2hfZGVmYXVsdFwiIFwibWFpblwiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgID0gXCJtYWluXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9zaXRvcnlcdTAwMWJbMG1cdTAwMWJbMG0gPSBcImF3cy1jb250cm9sXCIlMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfYnJhbmNoX3Byb3RlY3Rpb25cIiBcIm1haW5cIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dzX2RlbGV0aW9uc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dzX2ZvcmNlX3B1c2hlc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYmxvY2tzX2NyZWF0aW9uc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZW5mb3JjZV9hZG1pbnNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1sb2NrX2JyYW5jaFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1wYXR0ZXJuXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJtYWluXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5X2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVfY29udmVyc2F0aW9uX3Jlc29sdXRpb25cdTAwMWJbMG1cdTAwMWJbMG0gPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVfc2lnbmVkX2NvbW1pdHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVkX2xpbmVhcl9oaXN0b3J5XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgPSBmYWxzZSUwQSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXJlcXVpcmVkX3B1bGxfcmVxdWVzdF9yZXZpZXdzIHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVxdWlyZV9sYXN0X3B1c2hfYXBwcm92YWxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICA9IGZhbHNlJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcXVpcmVkX2FwcHJvdmluZ19yZXZpZXdfY291bnRcdTAwMWJbMG1cdTAwMWJbMG0gPSAwJTBBICAgICAgICB9JTBBJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtcmVxdWlyZWRfc3RhdHVzX2NoZWNrcyB7JTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWNvbnRleHRzXHUwMDFiWzBtXHUwMDFiWzBtID0gWyUwQSAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXCJUZXJyYWZvcm0gUGxhblwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RyaWN0XHUwMDFiWzBtXHUwMDFiWzBtICAgPSB0cnVlJTBBICAgICAgICB9JTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLmloXzhfcmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19hdXRvX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X21lcmdlX2NvbW1pdFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19yZWJhc2VfbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfc3F1YXNoX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFyY2hpdmVkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVmYXVsdF9icmFuY2hcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlbGV0ZV9icmFuY2hfb25fbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVzY3JpcHRpb25cdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgID0gXCJJbmZyYUhvdXNlIEJhc2ljIEFXUyBjb25maWd1cmF0aW9uXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ldGFnXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZnVsbF9uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWdpdF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfZG93bmxvYWRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19pc3N1ZXNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1oYXNfcHJvamVjdHNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc193aWtpXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHRtbF91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWh0dHBfY2xvbmVfdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgID0gXCJQUl9USVRMRVwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X3RpdGxlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcImF3cy1jb250cm9sXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ub2RlX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcHJpdmF0ZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9faWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gPSBcIkNPTU1JVF9NRVNTQUdFU1wiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZVx1MDAxYlswbVx1MDAxYlswbSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNzaF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdm5fdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdmlzaWJpbGl0eVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXZ1bG5lcmFiaWxpdHlfYWxlcnRzXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICA9IHRydWUlMEElMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWN1cml0eV9hbmRfYW5hbHlzaXMgeyUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1hZHZhbmNlZF9zZWN1cml0eSB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgfSUwQSUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmcgeyUwQSAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgIH0lMEElMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgfSUwQSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXRlbXBsYXRlIHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaW5jbHVkZV9hbGxfYnJhbmNoZXNcdTAwMWJbMG1cdTAwMWJbMG0gPSBmYWxzZSUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1vd25lclx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZThcIiUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1yZXBvc2l0b3J5XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICA9IFwidGVycmFmb3JtLXRlbXBsYXRlXCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImF3cy1zMy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG9cdTAwMWJbMG0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIgeyUwQSAgICAgICAgXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhd3MtczMtY29udHJvbFwiJTBBICAgICAgICBcdTAwMWJbMW1cdTAwMWJbMG1uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcImF3cy1zMy1jb250cm9sXCIlMEEgICAgICAgIFx1MDAxYls5MG0jICgzMSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtdGVtcGxhdGUgeyUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pbmNsdWRlX2FsbF9icmFuY2hlc1x1MDAxYlswbVx1MDAxYlswbSA9IGZhbHNlJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW93bmVyXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlOFwiJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9zaXRvcnlcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tdGVtcGxhdGVcIiUwQSAgICAgICAgfSUwQSUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDEgdW5jaGFuZ2VkIGJsb2NrIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG9cdTAwMWJbMG0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIgeyUwQSAgICAgICAgXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJnaXRodWItY29udHJvbFwiJTBBICAgICAgICBcdTAwMWJbMW1cdTAwMWJbMG1uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgPSBcImdpdGh1Yi1jb250cm9sXCIlMEEgICAgICAgIFx1MDAxYls5MG0jICgzMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtdGVtcGxhdGUgeyUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pbmNsdWRlX2FsbF9icmFuY2hlc1x1MDAxYlswbVx1MDAxYlswbSA9IGZhbHNlJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW93bmVyXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlOFwiJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9zaXRvcnlcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tdGVtcGxhdGVcIiUwQSAgICAgICAgfSUwQSUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDEgdW5jaGFuZ2VkIGJsb2NrIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgfSUwQSUwQVx1MDAxYlswbVx1MDAxYlsxbVBsYW46XHUwMDFiWzBtIDMgdG8gYWRkLCAyIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQVx1MDAxYlswbVx1MDAxYls5MG0lMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTAwMWJbMG0lMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMywgImNoYW5nZSI6IDIsICJkZXN0cm95IjogMH19```
</p></details>